Revit 2024 API
Generic Class
 A static class that provides access to the property names that appear in the Generic visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Generic
Visual Basic
Public NotInheritable Class Generic
Visual C++
public ref class Generic abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Generic
See Also
Generic Members
Autodesk.Revit.DB.Visual Namespace